"""
Текстові відповіді бота
Всі тексти зберігаються тут для зручності редагування та локалізації
"""

# Привітальні повідомлення
class BotReplies:
  WELCOME_MESSAGE = """💡 Що всередині курсу:

✔️ Як працює щитоподібна залоза та чому може “ламатися” метаболізм.
✔️ Норми аналізів по референсам саме Превентивної медицини 
✔️ Продукти, які підтримують роботу щитоподібної залози.
✔️ Чого категорично варто уникати при гіпотиреозі
✔️ «Працюючий кишківник» — чому це важливо.
✔️ Як Стрес, Сон.. впливають на роботу ЩЗ
✔️ Харчування для стабілізації стану.
✔️ Вітаміни та мікроелементи які потрібні  для повноцінної роботи щітоподібної залози 


💬 Для кого цей курс:

✔️ Ти маєш діагноз гіпотиреоз або аутоімунний тиреоїдит (AIT).
✔️ Стомилася боротися з вагою, набряками, втомою.
✔️ Не знаєш, що їсти, а що “заборонено”.
✔️ Хочеш покращити самопочуття та взяти здоров’я у свої руки.
⠀

🎁 Що отримаєш після курсу:

✅ Навчишся правильно інтерпретувати результати ЩЗ саме по референсам Превентивної медицини 
✅ Розуміння, як підтримувати щитоподібну залозу через харчування.
✅ Поліпшення самопочуття, більше енергії.
✅ Стратегію для поступового покращення роботи ЩЗ  ( реальну, без дієт-стресів).
✅ Зрозумілі інструкції, що робити щодня, щоб почувати себе прекрасно !

🥳 Бонус програми - закритий чат в ТГ каналі, в якому ти будеш особисто зі мною на звʼязку та зможеш поставити питання які тебе цікавлять ✅

🎁 Секрктний подарунок всередині 🎁 

💥І це все всього за 340 грн ‼️"""

  REGISTRATION_REQUEST = "Вітаю! Для реєстрації, будь ласка, натисніть кнопку нижче щоб надіслати свій номер телефону."

  # Повідомлення про помилки
  ERROR_MESSAGE = "❌ Виникла помилка. Спробуйте пізніше."
  DATABASE_ERROR = "❌ Виникла помилка при збереженні даних. Спробуйте пізніше."

  # Instagram повідомлення
  INSTAGRAM_INVITE = """🎉 Вітаю! Схоже, все добре, але щоб на 100% у цьому впевнитися 👌🏻, у мене для тебе є гарна пропозиція 💌
  ✍🏻 Напиши мені в дірект слово bot 🤖 — і отримай безкоштовну діагностичну консультацію 🩺✨"""

  ONLY_INSTAGRAM_INVITE = "Контакт для зв'язку:"

  # Платіжні повідомлення
  PAYMENT_MESSAGE = "Щоб перейти до наступних відео, тисни оплатити:"
  PAYMENT_ERROR = "Виникла помилка при створенні платежу. Будь ласка, спробуйте пізніше."

  MENU_MESSAGE = """📌 Доступні команди:
🏠 /start - на початок
📱 /contact - зв'язок зі мною
ℹ️ /about - про курс"""

  START_DESCRIPTION = "🏠 На початок"
  CONTACT_DESCRIPTION = "📱 Зв'язок зі мною"
  ABOUT_DESCRIPTION = "ℹ️ Про курс"
  CONTENT_DESCRIPTION= "📚 Переглянути контен"

  PAYMENT_DESCRIPTION = "ℹ️ Щоб придбати курс, тисни оплатити"
  PAYMENT_SUCCESS = "✅ Оплачено успішно!"
  PAYMENT_ERROR = "❌ Виникла помилка при оплаті. Спробуйте пізніше."
  PAYMENT_REMINDER = "Щоб отримати доступ до контенту, проведіть оплату."

  AFTER_PAYMENT_MESSAGE="Тепер ти маєш доступ до всього контенту."

