"""
Текстові відповіді бота
Всі тексти зберігаються тут для зручності редагування та локалізації
"""

# Привітальні повідомлення
class BotReplies:
  WELCOME_MESSAGE_1 = """🧠 У міні-курсі ти отримаєш:

✅ Розуміння, як працює щитоподібна залоза
Пояснює складне просто! 

✅ Що негативно впливає на ЩЗ і як це змінити
Про стрес, токсини, дефіцити й фактори, які можна контролювати

✅ Харчування при гіпотиреозі
• Що їсти для підтримки ЩЗ
• Які продукти блокують її роботу
• Часті помилки в дієтах — і як їх уникати

✅ Які аналізи дійсно варто здавати (і як часто)
• Референси превентивної медицини, а не “загальної норми”
• Як читати свої результати
• Як не втратити час 

✅ Конкретні інструкції – що робити вже сьогодні
• Посиланні на нутрицевтики
• Прості дії для стабілізації стану
• Поради з власної практики"""

  WELCOME_MESSAGE_2 = """🔍 Для кого цей курс:

• Ти маєш гіпотиреоз або підозрюєш, що він є
• Втома, набір ваги, холодні кінцівки, набряки, закрепи — частина твого життя
• Аналізи “в нормі”, але самопочуття — ні
• Хочеш розібратись у причинах, а не просто пити гормони
• Хочеш самостійно читати  свої  аналізи"""

  WELCOME_MESSAGE_3 = """🎁 Що отримаєш:

✅ Навчишся правильно інтерпретувати результати ЩЗ саме по референсам Превентивної медицини 
✅ Розуміння, як підтримувати щитоподібну залозу через харчування.
✅ Поліпшення самопочуття, більше енергії.
✅ Стратегію для поступового покращення роботи ЩЗ  ( реальну, без дієт-стресів).
✅ Зрозумілі інструкції, що робити щодня, щоб почувати себе прекрасно !"""

  PAYMENT_MESSAGE = """🥳 Бонус програми - закритий чат в ТГ каналі, в якому ти будеш особисто зі мною на звʼязку та зможеш поставити питання які тебе цікавлять ✅

🎁 Секретний подарунок всередині 🎁 

💥І це все всього за 340 грн ‼️"""

  ABOUT_MESSAGE = """Вітаю, на звʼязку *Світлана Марчик*
✅ Дипломований практикуючий *нутриціолог*
✅ Амбасадор Лондонського коледжу натуропатичної медицини (CNM)
✅ Health Coach (Європейська Асоціація Коучінга / European Coaching Association — ECA)
✅ Член Асоціації фахівців освітньої функціональної медицини (АСОФМ)
✅ Допомогла понад 500 людям стати здоровішими та щасливішими
✅ За моєю авторською методикою жінки стрункішають *без зривів*, при цьому харчуються смачно, різноманітно та корисно!
  """

  REGISTRATION_REQUEST = "Вітаю! Для реєстрації, будь ласка, натисніть кнопку нижче щоб надіслати свій номер телефону."

  # Повідомлення про помилки
  ERROR_MESSAGE = "❌ Виникла помилка. Спробуйте пізніше."
  DATABASE_ERROR = "❌ Виникла помилка при збереженні даних. Спробуйте пізніше."

  # Instagram повідомлення
  INSTAGRAM_INVITE = """🎉 Вітаю! Схоже, все добре, але щоб на 100% у цьому впевнитися 👌🏻, у мене для тебе є гарна пропозиція 💌
  ✍🏻 Напиши мені в дірект слово bot 🤖 — і отримай безкоштовну діагностичну консультацію 🩺✨"""

  ONLY_INSTAGRAM_INVITE = "Контакт для зв'язку:"

  # Платіжні повідомлення
  PAYMENT_ERROR = "Виникла помилка при створенні платежу. Будь ласка, спробуйте пізніше."

  MENU_MESSAGE = """📌 Доступні команди:
🏠 /start - на початок
📱 /contact - зв'язок зі мною
ℹ️ /about - про мене"""

  START_DESCRIPTION = "🏠 На початок"
  CONTACT_DESCRIPTION = "📱 Зв'язок зі мною"
  ABOUT_DESCRIPTION = "ℹ️ Про мене"
  CONTENT_DESCRIPTION= "📚 Переглянути контент"

  PAYMENT_DESCRIPTION = "ℹ️ Щоб придбати курс, тисни оплатити"
  PAYMENT_SUCCESS = "✅ Оплачено успішно!"
  PAYMENT_ERROR = "❌ Виникла помилка при оплаті. Спробуйте пізніше."
  PAYMENT_REMINDER = "Щоб отримати доступ до контенту, проведіть оплату."

  NOT_HAS_ACCESS_TO_CONTENT = "🔒 У вас немає доступу до контенту."

  AFTER_PAYMENT_MESSAGE="Тепер ти маєш доступ до всього контенту."

  CONTENT_NAVIGATION="Ви можете повернутися до попереднього або перейти до наступного:"

  CLOSED_TELEGRAM_GROUP = 'Натисни "Отримати доступ" та перейди до закритої групи:'

  DISCONT_DESCRIPTION = "Пиши в Дірект👉🏻 *«експрес-консультація»* та забирай знижку 40% на індивідуальну консультацію"


