"""
Текстові відповіді бота
Всі тексти зберігаються тут для зручності редагування та локалізації
"""

# Привітальні повідомлення
class BotReplies:
  WELCOME_MESSAGE_1 = """💡 Що всередині курсу:

✔️ Як працює щитоподібна залоза та чому може “ламатися” метаболізм.
✔️ Норми аналізів по референсам саме Превентивної медицини 
✔️ Продукти, які підтримують роботу щитоподібної залози.
✔️ Чого категорично варто уникати при гіпотиреозі
✔️ «Працюючий кишківник» — чому це важливо.
✔️ Як Стрес, Сон.. впливають на роботу ЩЗ
✔️ Харчування для стабілізації стану.
✔️ Вітаміни та мікроелементи які потрібні  для повноцінної роботи щітоподібної залози"""

  WELCOME_MESSAGE_2 = """💬 Для кого цей курс:

✔️ Ти маєш діагноз гіпотиреоз або аутоімунний тиреоїдит (AIT).
✔️ Стомилася боротися з вагою, набряками, втомою.
✔️ Не знаєш, що їсти, а що “заборонено”.
✔️ Хочеш покращити самопочуття та взяти здоров’я у свої руки."""

  WELCOME_MESSAGE_3 = """🎁 Що отримаєш на курсі:

✅ Навчишся правильно інтерпретувати результати ЩЗ саме по референсам Превентивної медицини 
✅ Розуміння, як підтримувати щитоподібну залозу через харчування.
✅ Поліпшення самопочуття, більше енергії.
✅ Стратегію для поступового покращення роботи ЩЗ  ( реальну, без дієт-стресів).
✅ Зрозумілі інструкції, що робити щодня, щоб почувати себе прекрасно !"""

  PAYMENT_MESSAGE = """🥳 Бонус програми - закритий чат в ТГ каналі, в якому ти будеш особисто зі мною на звʼязку та зможеш поставити питання які тебе цікавлять ✅

🎁 Секретний подарунок всередині 🎁 

💥І це все всього за 340 грн ‼️"""

  ABOUT_MESSAGE = """Вітаю, на звʼязку *Світлана Марчик*
✅ Дипломований практикуючий *нутриціолог*
✅ Амбасадор Лондонського коледжу натуропатичної медицини (CNM)
✅ Health Coach (Європейська Асоціація Коучінга / European Coaching Association — ECA)
✅ Член Асоціації фахівців освітньої функціональної медицини (АСОФМ)
✅ Допомогла понад 500 людям стати здоровішими та щасливішими
✅ За моєю авторською методикою жінки стрункішають *без зривів*, при цьому харчуються смачно, різноманітно та корисно!
  """

  REGISTRATION_REQUEST = "Вітаю! Для реєстрації, будь ласка, натисніть кнопку нижче щоб надіслати свій номер телефону."

  # Повідомлення про помилки
  ERROR_MESSAGE = "❌ Виникла помилка. Спробуйте пізніше."
  DATABASE_ERROR = "❌ Виникла помилка при збереженні даних. Спробуйте пізніше."

  # Instagram повідомлення
  INSTAGRAM_INVITE = """🎉 Вітаю! Схоже, все добре, але щоб на 100% у цьому впевнитися 👌🏻, у мене для тебе є гарна пропозиція 💌
  ✍🏻 Напиши мені в дірект слово bot 🤖 — і отримай безкоштовну діагностичну консультацію 🩺✨"""

  ONLY_INSTAGRAM_INVITE = "Контакт для зв'язку:"

  # Платіжні повідомлення
  PAYMENT_ERROR = "Виникла помилка при створенні платежу. Будь ласка, спробуйте пізніше."

  MENU_MESSAGE = """📌 Доступні команди:
🏠 /start - на початок
📱 /contact - зв'язок зі мною
ℹ️ /about - про мене"""

  START_DESCRIPTION = "🏠 На початок"
  CONTACT_DESCRIPTION = "📱 Зв'язок зі мною"
  ABOUT_DESCRIPTION = "ℹ️ Про мене"
  CONTENT_DESCRIPTION= "📚 Переглянути контент"

  PAYMENT_DESCRIPTION = "ℹ️ Щоб придбати курс, тисни оплатити"
  PAYMENT_SUCCESS = "✅ Оплачено успішно!"
  PAYMENT_ERROR = "❌ Виникла помилка при оплаті. Спробуйте пізніше."
  PAYMENT_REMINDER = "Щоб отримати доступ до контенту, проведіть оплату."

  NOT_HAS_ACCESS_TO_CONTENT = "🔒 У вас немає доступу до контенту."

  AFTER_PAYMENT_MESSAGE="Тепер ти маєш доступ до всього контенту."

  CONTENT_NAVIGATION="Ви можете повернутися до попереднього або перейти до наступного:"

  CLOSED_TELEGRAM_GROUP = 'Натисни "Отримати доступ" та перейди до закритої групи:'

  DISCONT_DESCRIPTION = "Пиши в Дірект👉🏻 *«експрес-консультація»* та забирай знижку 40% на індивідуальну консультацію"


